# MullionDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MullionDepth Property
ParameterTypeId Class See Also
---
"Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MullionDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MullionDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MullionDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace